"""Варіант 1"""

a_x1 = int(input('Введіть вершину А(х1):'))
a_y1 = int(input('Введіть вершину А(y1):'))
b_x2 = int(input('Введіть вершину В(х2):'))
b_y2 = int(input('Введіть вершину В(y2):'))
c_x3 = int(input('Введіть вершину С(х3):'))
c_y3 = int(input('Введіть вершину С(y3):'))

a_b = (a_x1-a_x2)*(a_x1-a_x2) + (a_y1-b_y2)*(a_y1-b_y2)
a_c = (a_x1-c_x3)*(a_x1-c_x3) + (a_y1-c_y3)*(a_y1-c_y3)
b_c = (b_x2-c_x3)*(b_x2-c_x3) + (b_y2-c_y3)*(b_y2-c_y3)

if a_b==a_c==b_c:
    print('Трикутник рівносторонній')
else:
    print('Трикутник не рівносторонній')
